-- MySQL dump 10.13  Distrib 8.0.31, for Win64 (x86_64)
--
-- Host: j8a509.p.ssafy.io    Database: ssafy_cow_db
-- ------------------------------------------------------
-- Server version	8.0.32

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `user_article_memo`
--

DROP TABLE IF EXISTS `user_article_memo`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `user_article_memo` (
  `memo_id` bigint NOT NULL AUTO_INCREMENT COMMENT '메모 ID',
  `memo_content` varchar(500) DEFAULT NULL COMMENT '메모 내용',
  `memo_end_index` int DEFAULT NULL COMMENT 'memoEndRange 속 메모 종료 위치',
  `memo_end_range` int DEFAULT NULL COMMENT '메모 종료 구간',
  `memo_public_scope` tinyint(1) NOT NULL DEFAULT '0' COMMENT '메모 공개 여부 : true-공개, false-비공개',
  `memo_start_index` int DEFAULT NULL COMMENT 'memoStartRange 속 메모 시작 위치',
  `memo_start_range` int DEFAULT NULL COMMENT '메모 시작 구간',
  `regtime` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '메모 작성 시간 : yyyy-MM-dd HH:mm:ss',
  `article_id` bigint DEFAULT NULL COMMENT '기사 ID',
  `user_id` bigint DEFAULT NULL COMMENT '회원 ID',
  PRIMARY KEY (`memo_id`),
  KEY `FKh0agrr0tkoc8mmtbugg7kpxj5` (`article_id`),
  KEY `FKtjfmqlqddacudrqvrt2ylh00m` (`user_id`),
  CONSTRAINT `FKh0agrr0tkoc8mmtbugg7kpxj5` FOREIGN KEY (`article_id`) REFERENCES `article` (`article_id`),
  CONSTRAINT `FKtjfmqlqddacudrqvrt2ylh00m` FOREIGN KEY (`user_id`) REFERENCES `user` (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=104 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user_article_memo`
--

LOCK TABLES `user_article_memo` WRITE;
/*!40000 ALTER TABLE `user_article_memo` DISABLE KEYS */;
INSERT INTO `user_article_memo` VALUES (1,'너무너무 유용해요!!\n',0,0,1,0,0,'2023-04-05 06:16:30',1,8),(2,'좋은 서비스네요.\n',0,0,1,0,0,'2023-04-05 06:17:18',1421,8),(3,'저도 주택담보대출 받아야겠습니다...',0,0,1,0,0,'2023-04-05 06:17:33',1414,8),(4,'하... 물가 오르니까 금리 그만올려요ㅡㅡ',0,0,1,0,0,'2023-04-05 06:18:47',1413,8),(5,'ㅎㅎ',21,10,1,75,7,'2023-04-05 12:53:46',100,4),(7,'ddj',36,27,0,3,20,'2023-04-05 13:44:55',635,4),(8,'dd',36,27,0,3,20,'2023-04-05 13:44:55',635,4),(9,'전기 에너지는 ',4,30,0,0,29,'2023-04-05 23:49:13',100,4),(10,'좋은 기사네요',6,20,1,20,15,'2023-04-05 23:58:48',1,4),(11,'ㄷㄷㄷ',50,16,0,0,10,'2023-04-05 23:59:35',45,4),(13,'gg',3,12,1,21,7,'2023-04-06 00:39:21',14,4),(14,'은행에 일임업을 허용하기 전엔 신중해야겠네요',15,50,1,49,48,'2023-04-06 01:25:17',4301,2),(15,'부럽다',16,74,0,0,74,'2023-04-06 01:33:37',4594,7),(18,'ㅇㅇㅇㅇ',172,21,0,124,21,'2023-04-06 01:44:38',45,4),(19,'ㅇㅇ',0,0,0,0,0,'2023-04-06 01:51:57',4284,1),(20,'여기에 주식 투자해도 될까요.?',40,37,0,0,36,'2023-04-06 01:53:59',4641,2),(21,'맞습니다. 최소한의 역량은 갖춘 후에 진출을 노려야 한다고 생각합니다. ',204,61,1,136,61,'2023-04-06 02:40:56',4301,1),(22,'화훼도 배송한다니 너무 좋을 거 같아요!',38,1,1,26,1,'2023-04-06 02:41:41',1,1),(23,'ISA의 뜻을 몰랐는데 해당 글자를 누르니까 설명이 나오네요. 덕분에 기사를 이해하는데 도움이 됐습니다.',1,13,1,28,9,'2023-04-06 02:48:10',4301,7),(24,'저 이거 가입했는데 200만 원까지인가 이자 비과세더라고요',52,40,1,49,40,'2023-04-06 02:48:53',4301,4),(25,'화훼 농가의 발전이 기대됩니다.',19,20,1,83,18,'2023-04-06 02:49:41',1,7),(26,'마음이 아픕니다.',0,0,1,0,0,'2023-04-06 02:53:30',1424,7),(27,'ㅇㅇㅇㄹㄴ',0,0,0,0,0,'2023-04-06 04:17:22',418,4),(28,'ㄶㄷㄷㄷㄷㄷㄷㄷㄷㄷㄷㄷㄷㄷㄷㄷㄷ',0,0,0,0,0,'2023-04-06 04:17:25',418,4),(29,'ㅇㅇㅇㅇㅇㅇㅇㅇㅇㅇ',0,0,0,0,0,'2023-04-06 04:17:27',418,4),(30,'ㄷㄷㄷㄷ',0,0,0,0,0,'2023-04-06 04:17:30',418,4),(31,'eㄱㄴㄷㄺ',0,0,0,0,0,'2023-04-06 04:17:33',418,4),(32,'ㄹㄷㅈㄱ',0,0,0,0,0,'2023-04-06 04:17:38',418,4),(33,'eㅈㅅㅈㄷㅅ',0,0,0,0,0,'2023-04-06 04:17:41',418,4),(34,'ㅈㄷㄱ',0,0,0,0,0,'2023-04-06 04:17:43',418,4),(35,'ㄷㅈㄱ',0,0,0,0,0,'2023-04-06 04:17:45',418,4),(36,'ㄷㅈㄱㄷ',0,0,0,0,0,'2023-04-06 04:17:47',418,4),(37,'ㄱㄷㅈㄱ',0,0,0,0,0,'2023-04-06 04:17:49',418,4),(38,'ㄱㄷㅈㄱㄷ',0,0,0,0,0,'2023-04-06 04:17:51',418,4),(39,'맞는 말씀',194,61,0,139,61,'2023-04-06 04:44:55',4301,2),(41,'dd',60,18,0,15,15,'2023-04-06 05:52:55',1,4),(42,'dddddddddddddddddddddddddd',26,4,0,20,1,'2023-04-06 05:55:58',1,4),(43,'ㄷㄷㄱ',99,11,0,18,8,'2023-04-06 06:18:46',13,4),(44,'ㅇㅇㅇ',104,32,0,63,29,'2023-04-06 06:43:49',15,4),(45,'ㅎㄹ',0,0,0,0,0,'2023-04-06 07:03:10',4,1),(49,'좋은 기사네요',0,0,1,0,0,'2023-04-06 08:00:32',5889,12),(58,'ㄹㅈㄷㄷㄱ',0,0,0,0,0,'2023-04-07 10:38:42',1,4),(59,'ㄷㄳ',0,0,0,0,0,'2023-04-07 10:38:53',1,4),(60,'njk',0,0,0,0,0,'2023-04-07 10:40:08',1,4),(61,'ㄹㄷㅈ',0,0,0,0,0,'2023-04-07 10:41:16',1,4),(62,'경제가 중요해\n',0,0,0,0,0,'2023-04-07 10:42:11',6847,14),(63,'ㄹㅇㄹ',0,0,0,0,0,'2023-04-07 10:51:09',1,4),(64,'ㄱㅎㄷㄹㅇ',0,0,0,0,0,'2023-04-07 10:54:39',1,4),(65,'ㅇㄴ',0,0,0,0,0,'2023-04-07 10:55:01',1,4),(66,'ㅇㄹㄴㅇㄹ',0,0,0,0,0,'2023-04-07 10:55:26',1,4),(67,'ㅇㄹㄴㅇ',0,0,0,0,0,'2023-04-07 10:55:36',1,4),(68,'일본 가고 싶다',0,0,0,0,0,'2023-04-07 11:06:41',8794,2),(69,'fdsf\n',0,0,0,0,0,'2023-04-07 11:07:00',1,4),(70,'jkl',0,0,0,0,0,'2023-04-07 11:08:57',100,4),(71,'fdjsk',0,0,0,0,0,'2023-04-07 11:10:05',100,4),(72,'경제용어를 바로 확인할 수 있어 너무 편하네요!',0,0,1,0,0,'2023-04-07 11:42:20',4301,6),(76,'ㄹㄷㅈ',0,0,0,0,0,'2023-04-07 11:52:38',1,4),(77,'ㄱㄷㅈㄷ',0,0,0,0,0,'2023-04-07 11:52:46',1,4),(78,'ㄱㄷㅅㄱㄴㄴㅇㄹ',0,0,0,0,0,'2023-04-07 11:53:01',100,4),(79,'ㅇㅇ',0,0,0,0,0,'2023-04-07 11:53:07',100,4),(80,'ㄹㄹ',0,0,0,0,0,'2023-04-07 11:53:20',1,4),(82,'롯ㄱ',0,0,0,0,0,'2023-04-07 11:54:33',1,4),(83,'ㅇㄹㄷ',0,0,0,0,0,'2023-04-07 11:56:25',1,4),(84,'der',0,0,0,0,0,'2023-04-07 12:00:09',1,4),(85,'45',0,0,0,0,0,'2023-04-07 12:00:43',1,4),(86,'rtyytr',0,0,0,0,0,'2023-04-07 12:00:50',1,4),(88,'dfs',0,0,0,0,0,'2023-04-07 12:02:31',1,4),(89,'작성 테스트',0,0,0,0,0,'2023-04-07 12:03:05',4301,6),(90,'dfwse',0,0,0,0,0,'2023-04-07 12:03:09',100,4),(91,'fdgf',0,0,0,0,0,'2023-04-07 12:04:36',1,4),(92,'dfs',0,0,0,0,0,'2023-04-07 12:04:47',1,4),(93,'wre',0,0,0,0,0,'2023-04-07 12:04:53',1,4),(94,'ddd',0,0,0,0,0,'2023-04-07 12:05:03',100,4),(95,'ㅇㅇ',0,0,0,0,0,'2023-04-07 12:05:26',8918,6),(96,'hjkfgjdhgjdf',0,0,0,0,0,'2023-04-07 12:08:42',100,4),(97,'dsfe',0,0,0,0,0,'2023-04-07 12:11:17',1,4),(98,'dfewefkgf',0,0,0,0,0,'2023-04-07 12:28:04',100,4),(99,'Yeah~',0,12,1,87,10,'2023-04-07 12:29:38',8901,1),(100,'멋지다...',0,0,0,0,0,'2023-04-07 12:37:42',4301,15),(101,'괜히 팔았다...',0,0,0,0,0,'2023-04-07 12:39:41',8915,15),(102,'우아 진짜 쩐다',0,0,1,0,0,'2023-04-07 13:01:57',8918,16);
/*!40000 ALTER TABLE `user_article_memo` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-04-07 14:04:35
